---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HeadOnPlacementMethod
source: html/4ed57201-86ed-379f-612a-ba6b17f3e647.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HeadOnPlacementMethod Property

"Draw in Foreground"

## Syntax (C#)
```csharp
public static ForgeTypeId HeadOnPlacementMethod { get; }
```